{
  // manifest.json
  "extensionName": {
    "message": "Mastodon – Simplified Federation!",
    "description": "Name of the extension."
  },
  "extensionNameShort": {
    "message": "Mastodon – Simplified Federation!",
    "description": "Name of the extension."
  },
  "extensionDescription": {
    "message": "Simplifies following or interacting with other users on remote (Mastodon) instances.",
    "description": "Description of the extension."
  },

  // errors or other messages (mostly for settings)
  "errorShowingMessage": {
    "message": "Could not show this message.",
    "description": "When there is an error when showing the error/info/…."
  },
  "couldNotLoadOptions": {
    "message": "Could not load settings.",
    "description": "When one or all settings could not be loaded."
  },
  "couldNotSaveOption": {
    "message": "Could not save this setting.",
    "description": "When a setting could not be saved."
  },
  "messageUndoButton": {
    "message": "Undo",
    "description": "The text of a button that undoes the last action."
  },
  "couldNotUndoAction": {
    "message": "Could not undo action.",
    "description": "Shown when an action cannot be undone."
  },
  "resettingOptionsWorked": {
    "message": "All settings are now back to defaults again!",
    "description": "The message shown, when the options of the settings were reset."
  },
  "resettingOptionsFailed": {
    "message": "Could not reset options!",
    "description": "The message shown, when the options of the settings could not have been reset."
  },

  // errors or other messages for specific settings
  "mastodonHandleIsEmpty": {
    "message": "Please enter a Mastodon account. Without it, the add-on will not work.",
    "description": "This is an error shown, when the user did not (yet) enter a Mastodon account."
  },
  "mastodonHandleIsInvalid": {
    "message": "The Mastodon account you entered is invalid.",
    "description": "This is an error shown, when the Mastodon handle the user entered is not valid."
  },
  "mastodonHandleDoesNotExist": {
    "message": "The Mastodon user you provided does not exist on that server.",
    "description": "This is an error shown, when the Mastodon handle the user entered does not exist on the server, i.e. the server returns a 404 error."
  },
  "mastodonHandleServerCouldNotBeContacted": {
    "message": "The provided (Mastodon) server could not be contacted.",
    "description": "This is an error shown, when the last part of Mastodon handle (= the server) could not be contacted, due to a network (likely DNS) error and thus likely due to a typo or another problem."
  },
  "isNoMastodonServer": {
    "message": "The provided server is no instance of Mastodon.",
    "description": "This is an error shown, when the last part of Mastodon handle (= the server) is actually no Mastodon server."
  },
  "mastodonHandleCheckFailed": {
    "message": "Verification of the entered Mastodon account failed.",
    "description": "This is an error shown, when the server that has been contacted to verify the handle returned an unexpected response."
  },

  "addonIsNotYetSetup": {
    "message": "This add-on is not yet set up. You need to enter your Mastodon account in the settings.",
    "description": "This is an error shown, when the user did not (yet) setup the whole add-on. Semantically it is the same as mastodonHandleIsEmpty, but this one is used in the notification."
  },
  "couldNotRedirect": {
    "message": "Could not redirect due to an unexpected error.",
    "description": "Generic error shown when redirecting fails."
  },

  // notification errors
  "errorNotificationRedirectingTitle": {
    "message": "“$ADDON$” failed to redirect",
    "description": "Title of a notification if an error is shown when trying to redirect.",
    "placeholders": {
      "addon": {
        "content": "$1",
        "example": "Mastodon – Simplified Federation!"
      }
    }
  },
  "errorNotificationNotSetupTitle": {
    "message": "“$ADDON$” is not yet configured",
    "description": "Title of a notification if an error is shown when the add-on is not set up yet. In contrast to errorNotificationRedirectingTitle this is only shown for this one error. See also addonIsNotYetSetup.",
    "placeholders": {
      "addon": {
        "content": "$1",
        "example": "Mastodon – Simplified Federation!"
      }
    }
  },

  "errorNotificationAdjustSettings": {
    "message": "$ERROR$ Click to adjust the settings.",
    "description": "Wrapper shown if an error happened to point the user to the settings. It is used in the description of the notification.",
    "placeholders": {
      "error": {
        "content": "$1",
        "example": "Please enter a Mastodon handle. Without it, the add-on will not work."
      }
    }
  },

  // options
  "someSettingsAreManaged": {
    "message": "Some settings are managed by your system administrator and cannot be changed.",
    "description": "The message, which appears, when settings are pre-defined (as managed options) by administrators."
  },
  "optionIsDisabledBecauseManaged": {
    "message": "This option is disabled, because it has been configured by your system administrator.",
    "description": "The title (tooltip) shown, when hovering over a disabled, managed option."
  },
  "optionLearnMore": {
    "message": "Learn more",
    "description": "When a link to an explainer needs to be added, this is the link text."
  },
  "optionsResetButton": {
    "message": "Reset all settings to defaults",
    "description": "The button to delete all current settings and load the defaults, shown in the add-on settings."
  },

  "optionMastodonHandle": {
    "message": "Your Mastodon account: ",
    "description": "This is an option shown in the add-on settings. You can enter your handle in the format mastodon@server.com there."
  },
  "optionMastodonHandlePlaceholder": {
    "message": "you@mastodon.example",
    "description": "This is placeholder shown for the Mastodon handle input. Try to give an example on format the user has to use to enter the ID as  mastodon@server.com here. Do not use a real server name and do not promote any really existing user."
  },
  "optionMastodonHandleHelper": {
    "message": "Please enter your Mastodon handle in the format “username@serverdomain”.",
    "description": "An explanatory text shown to the user in the settings to explain what format they have to enter the Mastodon handle. It should not hint to any example (that's what the placeholder is for), but explain the general format."
  },

  // ARIA labels/descriptions for messages
  "dismissIconDescription": {
    "message": "Close this message",
    "description": "the aria label for the close button of the message box"
  },
  "ariaMessageInfo": {
    "message": "info message",
    "description": "the aria label to label the message box as an info message box"
  },
  "ariaMessageSuccess": {
    "message": "success message",
    "description": "the aria label to label the message box as an success message box"
  },
  "ariaMessageError": {
    "message": "error message",
    "description": "the aria label to label the message box as an error message box"
  },
  "ariaMessageWarning": {
    "message": "warning message",
    "description": "the aria label to label the message box as an warning message box"
  }
}
