{
  // manifest.json
  "extensionName": {
    "message": "Mastodon – Simplified Federation!",
    "description": "Name of the extension."
  },
  "extensionNameShort": {
    "message": "Mastodon – Simplified Federation!",
    "description": "Name of the extension."
  },
  "extensionDescription": {
    "message": "Vereinfacht das Folgen und Interagieren mit Nutzern auf anderen Instanzen.",
    "description": "Description of the extension."
  },

  // errors or other messages (mostly for settings)
  "errorShowingMessage": {
    "message": "Konnte Nachricht nicht anzeigen.",
    "description": "When there is an error when showing the error/info/…."
  },
  "couldNotLoadOptions": {
    "message": "Konnte Einstellungen nicht laden.",
    "description": "When one or all settings could not be loaded."
  },
  "couldNotSaveOption": {
    "message": "Konnte diese Einstellung nicht speichern.",
    "description": "When a setting could not be saved."
  },
  "messageUndoButton": {
    "message": "Rückgängig machen",
    "description": "The text of a button that undoes the last action."
  },
  "couldNotUndoAction": {
    "message": "Konnte Aktion nicht rückgängig machen.",
    "description": "Shown when an action cannot be undone."
  },
  "resettingOptionsWorked": {
    "message": "Alle Einstellungen benutzen nun wieder die Standardwerte!",
    "description": "The message shown, when the options of the settings were reset."
  },
  "resettingOptionsFailed": {
    "message": "Konnte Optionen nicht zurück setzen!",
    "description": "The message shown, when the options of the settings could not have been reset."
  },

  // errors or other messages for specific settings
  "mastodonHandleIsEmpty": {
    "message": "Bitte gib ein mastodon-Handle ein. Ohne es wird es nicht funktionieren.",
    "description": "This is an error shown, when the user did not (yet) enter a Mastodon handle."
  },
  "mastodonHandleIsInvalid": {
    "message": "Das Mastodon-Handle, dass du eingeben hast, ist invalid.",
    "description": "This is an error shown, when the Mastodon handle the user entered is not valid."
  },

  // options
  "someSettingsAreManaged": {
    "message": "Einige Einstellung werden von deinem Systemadministrator festgelegt und können nicht geändert werden.",
    "description": "The message, which appears, when settings are pre-defined (as managed options) by administrators."
  },
  "optionIsDisabledBecauseManaged": {
    "message": "Diese option ist deaktiviert, weil sie von deinem Systemadministrator festgelegt wurde.",
    "description": "The title (tooltip) shown, when hovering over a disabled, managed option."
  },
  "optionLearnMore": {
    "message": "Weitere Informationen",
    "description": "When a link to an explainer needs to be added, this is the link text."
  },
  "optionsResetButton": {
    "message": "Setze alle Einstellungen auf Standardwerte zurück",
    "description": "The button to delete all current settings and load the defaults, shown in the add-on settings."
  },

  "optionMastodonHandle": {
    "message": "Dein Mastodon-Handle: ",
    "description": "This is an option shown in the add-on settings. You can enter your handle in the form mastodon@server.com there."
  },
  "optionMastodonHandlePlaceholder": {
    "message": "du@mastodon.example",
    "description": "This is placeholder shown for the Mastodon handle input. Try to give an example on format the user has to use to enter the ID as  mastodon@server.com here. Do not use a real server name and do not promote any really existing user."
  },
  "optionMastodonHandleHelper": {
    "message": "Bitte gib dein Mastodon-Handle im Format Profilname@Serverdomain ein.",
    "description": "An explanatory text shown to the user in the settings to explain what format they have to enter the Mastodon handle. It should not hint to any example (that's what the placeholder is for), but explain the general format."
  },

  // ARIA labels/descriptions
  "dismissIconDescription": {
    "message": "Diese Nachricht schließen",
    "description": "the label for the close button of the message box"
  }
}
